# Data Cleaning bom.movie

In [1]:
import pandas as pd
import numpy as np

In [2]:
!ls

Data                          Top 10 Driectors.png
Data Cleaning.ipynb           Top 10 Writers.png
Data Join Visualization.ipynb Top Primary Genre.png
Director_vs_gross.ipynb       Top Secondary Genre.png
Profit Primary Genre.png      Top Tertiary Genre.png
Profit Secondary Genre.png    data.ipynb
README.md                     main.ipynb
Stephen.ipynb                 tmdb_movie_clean.ipynb
Top 10 Actors.png             untitled

In [3]:
bom = pd.read_csv('Data/bom.movie_gross.csv')

In [4]:
bom.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

In [5]:
bom['foreign_gross'] = bom['foreign_gross'].replace(',','', regex = True)
#getting rid of commas so I can covert string to a float

In [6]:
bom['foreign_gross']= bom['foreign_gross'].astype(float)
#converting string to float

In [7]:
top_500_dom = bom.nlargest(500, ['domestic_gross'])

In [8]:
top_500_dom.isna().sum()
#looking to find if there are many null values in the top 500 movies
#null values aren't relevant in top 500 which means we can get rid of all rows that have nulls

title             0
studio            0
domestic_gross    0
foreign_gross     2
year              0
dtype: int64

In [9]:
bom = bom[bom['domestic_gross'].notna()]

In [10]:
bom = bom[bom['studio'].notna()]

In [11]:
bom = bom[bom['foreign_gross'].notna()]

#getting rid of missing values

In [12]:
bom

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000.0,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000.0,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000.0,2010
3,Inception,WB,292600000.0,535700000.0,2010
4,Shrek Forever After,P/DW,238700000.0,513900000.0,2010
...,...,...,...,...,...
3275,I Still See You,LGF,1400.0,1500000.0,2018
3286,The Catcher Was a Spy,IFC,725000.0,229000.0,2018
3309,Time Freak,Grindstone,10000.0,256000.0,2018
3342,Reign of Judges: Title of Liberty - Concept Short,Darin Southa,93200.0,5200.0,2018
3353,Antonio Lopez 1970: Sex Fashion & Disco,FM,43200.0,30000.0,2018

In [13]:
bom

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000.0,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000.0,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000.0,2010
3,Inception,WB,292600000.0,535700000.0,2010
4,Shrek Forever After,P/DW,238700000.0,513900000.0,2010
...,...,...,...,...,...
3275,I Still See You,LGF,1400.0,1500000.0,2018
3286,The Catcher Was a Spy,IFC,725000.0,229000.0,2018
3309,Time Freak,Grindstone,10000.0,256000.0,2018
3342,Reign of Judges: Title of Liberty - Concept Short,Darin Southa,93200.0,5200.0,2018
3353,Antonio Lopez 1970: Sex Fashion & Disco,FM,43200.0,30000.0,2018

## Data cleaning name.basics

In [14]:
n_b = pd.read_csv('Data/imdb.name.basics.csv')

In [15]:
n_b.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 606648 entries, 0 to 606647
Data columns (total 6 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   nconst              606648 non-null  object
 1   primary_name        606648 non-null  object
 2   birth_year          82736 non-null   float64
 3   death_year          6783 non-null    float64
 4   primary_profession  555308 non-null  object
 5   known_for_titles    576444 non-null  object
dtypes: float64(2), object(4)
memory usage: 27.8+ MB

In [16]:
n_b = n_b.drop('birth_year', 1)
#deleted birth year because not relevant

/var/folders/m3/ywsrz7k170vbk8511l1h_6840000gn/T/ipykernel_61188/2995651369.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only
  n_b = n_b.drop('birth_year', 1)

In [17]:
n_b = n_b[n_b['death_year'].isna()]
#got rid of any people who are dead

In [18]:
n_b = n_b.drop('death_year', 1)
#got rid of death year because no longer relevant

/var/folders/m3/ywsrz7k170vbk8511l1h_6840000gn/T/ipykernel_61188/1327480616.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only
  n_b = n_b.drop('death_year', 1)

In [27]:
n_b = n_b[n_b['known_for_titles'].notna()]
# got rid of na values in title id

In [28]:
n_b.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 529154 entries, 0 to 606647
Data columns (total 4 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   nconst              529154 non-null  object
 1   primary_name        529154 non-null  object
 2   primary_profession  529154 non-null  object
 3   known_for_titles    529154 non-null  object
dtypes: object(4)
memory usage: 20.2+ MB

In [29]:
n_b = n_b[n_b['primary_profession'].notna()]
#got rid of na values in primary profession

In [31]:
n_b

,nconst,primary_name,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"
...,...,...,...,...
606639,nm9989840,Mariya Shekaturova,actor,tt5953804
606640,nm9989854,Layla Louise,"actress,stunts","tt9910102,tt9898328,tt9335490,tt8894778"
606644,nm9990690,Joo Yeon So,actress,"tt9090932,tt8737130"
606645,nm9991320,Madeline Smith,actress,"tt8734436,tt9615610"
606647,nm9993380,Pegasus Envoyé,"director,actor,writer",tt8743182

# Data cleaning title.akas

In [32]:
t_a = pd.read_csv('Data/imdb.title.akas.csv')

In [33]:
t_a.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 331703 entries, 0 to 331702
Data columns (total 8 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   title_id           331703 non-null  object
 1   ordering           331703 non-null  int64
 2   title              331703 non-null  object
 3   region             278410 non-null  object
 4   language           41715 non-null   object
 5   types              168447 non-null  object
 6   attributes         14925 non-null   object
 7   is_original_title  331678 non-null  float64
dtypes: float64(1), int64(1), object(6)
memory usage: 20.2+ MB

In [34]:
t_a = t_a.drop('language', 1)

#dropped language because too many na's

/var/folders/m3/ywsrz7k170vbk8511l1h_6840000gn/T/ipykernel_61188/3790387345.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only
  t_a = t_a.drop('language', 1)

In [35]:
t_a = t_a.drop('types', 1)
#dropped types because too many na's, not relevant

/var/folders/m3/ywsrz7k170vbk8511l1h_6840000gn/T/ipykernel_61188/2448917448.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only
  t_a = t_a.drop('types', 1)

In [36]:
t_a.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 331703 entries, 0 to 331702
Data columns (total 6 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   title_id           331703 non-null  object
 1   ordering           331703 non-null  int64
 2   title              331703 non-null  object
 3   region             278410 non-null  object
 4   attributes         14925 non-null   object
 5   is_original_title  331678 non-null  float64
dtypes: float64(1), int64(1), object(4)
memory usage: 15.2+ MB

In [37]:
t_a = t_a.drop('attributes', 1)
#dropped attributes because too many na's

/var/folders/m3/ywsrz7k170vbk8511l1h_6840000gn/T/ipykernel_61188/557549458.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only
  t_a = t_a.drop('attributes', 1)

In [38]:
# t_a.set_index('title_id', inplace = True)
# setting the title id as index

In [39]:
t_a.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 331703 entries, 0 to 331702
Data columns (total 5 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   title_id           331703 non-null  object
 1   ordering           331703 non-null  int64
 2   title              331703 non-null  object
 3   region             278410 non-null  object
 4   is_original_title  331678 non-null  float64
dtypes: float64(1), int64(1), object(3)
memory usage: 12.7+ MB

In [40]:
is_original_title = t_a['is_original_title'] == 1

In [41]:
is_original_title = t_a[is_original_title]

In [42]:
t_a = is_original_title
#I only want original titles to get rid of repeats

In [43]:
t_a = t_a.drop('region', 1)

/var/folders/m3/ywsrz7k170vbk8511l1h_6840000gn/T/ipykernel_61188/546605675.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only
  t_a = t_a.drop('region', 1)

In [44]:
t_a = t_a.drop('ordering', 1)
#region and ordering are not relevant

/var/folders/m3/ywsrz7k170vbk8511l1h_6840000gn/T/ipykernel_61188/841517945.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only
  t_a = t_a.drop('ordering', 1)

In [45]:
t_a

,title_id,title,is_original_title
38,tt0369610,Jurassic World,1.0
80,tt0401729,John Carter,1.0
83,tt10010134,Versailles Rediscovered - The Sun King's Vanis...,1.0
86,tt10027708,Miguelito - Canto a Borinquen,1.0
90,tt10050722,Thing I Don't Get,1.0
...,...,...,...
331690,tt9723084,Anderswo. Allein in Afrika,1.0
331692,tt9726638,Monkey King: The Volcano,1.0
331696,tt9755806,Big Shark,1.0
331698,tt9827784,Sayonara kuchibiru,1.0
331700,tt9880178,La atención,1.0

#data cleaning title basics

In [46]:
!ls

Data                          Top 10 Driectors.png
Data Cleaning.ipynb           Top 10 Writers.png
Data Join Visualization.ipynb Top Primary Genre.png
Director_vs_gross.ipynb       Top Secondary Genre.png
Profit Primary Genre.png      Top Tertiary Genre.png
Profit Secondary Genre.png    data.ipynb
README.md                     main.ipynb
Stephen.ipynb                 tmdb_movie_clean.ipynb
Top 10 Actors.png             untitled

# Data cleaning title basics

In [51]:
t_b = pd.read_csv('Data/imdb.title.basics.csv')

In [52]:
t_b

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"
...,...,...,...,...,...,...
146139,tt9916538,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,2019,123.0,Drama
146140,tt9916622,Rodolpho Teóphilo - O Legado de um Pioneiro,Rodolpho Teóphilo - O Legado de um Pioneiro,2015,NaN,Documentary
146141,tt9916706,Dankyavar Danka,Dankyavar Danka,2013,NaN,Comedy
146142,tt9916730,6 Gunn,6 Gunn,2017,116.0,NaN
146143,tt9916754,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,2013,NaN,Documentary

In [53]:
t_b = t_b.drop('runtime_minutes', 1)
#don think runtime is relevant data

/var/folders/m3/ywsrz7k170vbk8511l1h_6840000gn/T/ipykernel_61188/3839429948.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only
  t_b = t_b.drop('runtime_minutes', 1)

In [54]:
t_b = t_b[t_b['genres'].notna()]
#getting rid of na values in genres

In [55]:
t_b = t_b.drop('original_title', 1)
#getting rid of og title because not necessary

/var/folders/m3/ywsrz7k170vbk8511l1h_6840000gn/T/ipykernel_61188/148550685.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only
  t_b = t_b.drop('original_title', 1)

# data cleaning title crew

In [64]:
t_c = pd.read_csv('Data/imdb.title.crew.csv.gz')

In [65]:
t_c.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 3 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   tconst     146144 non-null  object
 1   directors  140417 non-null  object
 2   writers    110261 non-null  object
dtypes: object(3)
memory usage: 3.3+ MB

In [66]:
t_c = t_c[t_c['directors'].notna()]

In [67]:
t_c = t_c[t_c['writers'].notna()]
#got rid of na values

# data cleaning title principals

In [70]:
t_p = pd.read_csv('Data/imdb.title.principals.csv')

In [71]:
t_p.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1028186 entries, 0 to 1028185
Data columns (total 6 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   tconst      1028186 non-null  object
 1   ordering    1028186 non-null  int64
 2   nconst      1028186 non-null  object
 3   category    1028186 non-null  object
 4   job         177684 non-null   object
 5   characters  393360 non-null   object
dtypes: int64(1), object(5)
memory usage: 47.1+ MB

In [72]:
t_p = t_p.drop('characters',1)
# dropped characters not relevant

/var/folders/m3/ywsrz7k170vbk8511l1h_6840000gn/T/ipykernel_61188/2881274645.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only
  t_p = t_p.drop('characters',1)

In [73]:
t_p = t_p.drop('ordering',1)

/var/folders/m3/ywsrz7k170vbk8511l1h_6840000gn/T/ipykernel_61188/3368346571.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only
  t_p = t_p.drop('ordering',1)

In [74]:
t_p = t_p.drop('job', 1)

/var/folders/m3/ywsrz7k170vbk8511l1h_6840000gn/T/ipykernel_61188/686105864.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only
  t_p = t_p.drop('job', 1)

In [75]:
t_p.rename({'category':'job'}, axis = 1, inplace = True)
#changed category to job because more accurate

# Data cleaning title rating

In [79]:
t_r = pd.read_csv('Data/imdb.title.ratings.csv.gz')

In [80]:
t_r.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73856 entries, 0 to 73855
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         73856 non-null  object
 1   averagerating  73856 non-null  float64
 2   numvotes       73856 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.7+ MB

In [81]:
t_r

           tconst  averagerating  numvotes
0      tt10356526            8.3        31
1      tt10384606            8.9       559
2       tt1042974            6.4        20
3       tt1043726            4.2     50352
4       tt1060240            6.5        21
...           ...            ...       ...
73851   tt9805820            8.1        25
73852   tt9844256            7.5        24
73853   tt9851050            4.7        14
73854   tt9886934            7.0         5
73855   tt9894098            6.3       128

[73856 rows x 3 columns]